In [28]:
import pandas as pd

df = pd.read_csv('result stude.txt')
print(df.head())

      Name  english  maths  science
0    sinan       95     85       90
1  regdhan       65     76       85
2   vyshak       45     96      100
3    almas       75     46       35
4     abin       65     49       85

In [29]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     10 non-null     object
 1   english  10 non-null     int64
 2   maths    10 non-null     int64
 3   science  10 non-null     int64
dtypes: int64(3), object(1)
memory usage: 452.0+ bytes

          english      maths     science
count   10.000000  10.000000   10.000000
mean    67.900000  67.900000   74.600000
std     28.861547  20.490919   27.741665
min     15.000000  46.000000   25.000000
25%     50.000000  49.000000   57.250000
50%     70.000000  66.000000   85.000000
75%     92.500000  85.750000   92.250000
max    100.000000  96.000000  100.000000

In [32]:
#Calculate Average Score
df['Average'] = df[['maths', 'science', 'english']].mean(axis=1)
df

      Name  english  maths  science    Average
0    sinan       95     85       90  90.000000
1  regdhan       65     76       85  75.333333
2   vyshak       45     96      100  80.333333
3    almas       75     46       35  52.000000
4     abin       65     49       85  66.333333
5    salam       99     90       93  94.000000
6   shahas       35     49       48  44.000000
7   shamil      100     56       85  80.333333
8       ut       15     46       25  28.666667
9   nehala       85     86      100  90.333333

In [34]:
#Find Top Performers
top_students = df.sort_values(by='Average', ascending=False)
print(top_students.head(5))

     Name  english  maths  science    Average
5   salam       99     90       93  94.000000
9  nehala       85     86      100  90.333333
0   sinan       95     85       90  90.000000
2  vyshak       45     96      100  80.333333
7  shamil      100     56       85  80.333333

In [35]:
#Pass/Fail Analysis
df['Passed'] = df['Average'] > 40
print(df['Passed'].value_counts())

Passed
True     9
False    1
Name: count, dtype: int64

In [36]:
#Save Results
df.to_csv('student_analysis.csv', index=False)